INSERT INTO [dbo].[Izdavachi] (Ime, Grad, Drzava, SektorId)
SELECT i.Ime, i.Grad, i.Drzava, s.Id
FROM (
	VALUES
	(N'Алкалоид АД Скопје', N'Скопје', N'Р.Македонија', N'Индустрија'),
	(N'Комерцијална банка АД Скопје', N'Скопје', N'Р.Македонија', N'Банкарство'),
	(N'Стопанска банка АД Скопје', N'Скопје', N'Р.Македонија', N'Банкарство'),
	(N'Жито Лукс АД Скопје', N'Скопје', N'Р.Македонија', N'Индустрија'),
	(N'ТТК банка АД Скопје', N'Скопје', N'Р.Македонија', N'Банкарство'),
	(N'Гранит АД Скопје', N'Скопје', N'Р.Македонија', N'Градежништво'),
	(N'НЛБ банка АД Скопје', N'Скопје', N'Р.Македонија', N'Банкарство'),
	(N'Макпетрол АД Скопје', N'Скопје', N'Р.Македонија', N'Трговија'),
	(N'Реплек АД Скопје', N'Скопје', N'Р.Македонија', N'Трговија'),
	(N'Македонски Телеком АД Скопје', N'Скопје', N'Р.Македонија', N'Услуги'),
	(N'Пелистерка АД Скопје', N'Скопје', N'Р.Македонија', N'Индустрија'),
	(N'Македонијатурист АД Скопје', N'Скопје', N'Р.Македонија', N'Угостителство'),
	(N'Алта банка АД Битола', N'Битола', N'Р.Македонија', N'Банкарство'),
	(N'Витаминка АД Прилеп', N'Прилеп', N'Р.Македонија', N'Индустрија'),
	(N'Фершпед АД Скопје', N'Скопје', N'Р.Македонија', N'Услуги')
) AS i (Ime, Grad, Drzava, SektorIme)
JOIN [dbo].[Sektori] AS s
	ON s.Ime = i.SektorIme;
